tap "buo/cask-upgrade"
tap "craciuncezar/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "neovim/neovim"
brew "bat"
brew "gcc"
brew "btop"
brew "coreutils"
brew "node"
brew "readline"
brew "sqlite"
brew "xz"
brew "emscripten"
brew "fd"
brew "gh"
brew "git-delta"
brew "git-flow"
brew "go"
brew "himalaya"
brew "htop"
brew "imagemagick"
brew "lazygit"
brew "libyaml"
brew "lua@5.1"
brew "luajit", args: ["HEAD"]
brew "mackup"
brew "mas"
brew "tree-sitter"
brew "neovim", args: ["HEAD"]
brew "neovim-remote"
brew "openssl@3"
brew "pyenv"
brew "ripgrep"
brew "ruby"
brew "thefuck"
brew "tmux"
brew "tree"
brew "wget"
brew "yarn"
brew "zlib"
brew "zoxide"
brew "zsh-completions"
brew "craciuncezar/tap/git-smart-checkout"
cask "alt-tab"
cask "android-studio"
cask "choosy"
cask "dash"
cask "dozer"
cask "flutter"
cask "google-chrome"
cask "iina"
cask "kitty"
cask "slack"
cask "spotify"
cask "vlc"
cask "webtorrent"
mas "Amphetamine", id: 937984704
mas "Dropover", id: 1355679052
mas "Flow", id: 1423210932
mas "Hand Mirror", id: 1502839586
mas "Pages", id: 409201541
mas "Prime Video", id: 545519333
mas "Spark", id: 1176895641
mas "Todoist", id: 585829637
mas "Xcode", id: 497799835
