tap "bufbuild/buf"
tap "buo/cask-upgrade"
tap "craciuncezar/tap"
tap "datawire/blackbird"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "neovim/neovim"
tap "romkatv/powerlevel10k"
# General-purpose data compression with high compression ratio
brew "xz"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU compiler collection
brew "gcc"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Manage compile and link flags for libraries
brew "pkg-config"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Vector graphics library with cross-device output support
brew "cairo"
# Next-gen compiler infrastructure
brew "llvm"
# C/C++/ObjC language server
brew "ccls"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# OpenType text shaping engine
brew "harfbuzz"
# LLVM bytecode to JavaScript compiler
brew "emscripten"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast and simple Node.js version manager
brew "fnm"
# Generic library support script
brew "libtool"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Infamous electronic fortune-cookie generator
brew "fortune"
# GNU compiler collection
brew "gcc@11"
# GitHub command-line tool
brew "gh"
# Automatic git commit --fixup
brew "git-absorb"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Open-source GitLab command-line tool
brew "glab"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Database migrations CLI tool
brew "golang-migrate"
# Fast linters runner for Go
brew "golangci-lint"
# Post-modern modal text editor
brew "helix"
# CLI email client written in Rust
brew "himalaya"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Database of common MIME types
brew "shared-mime-info"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kcat"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Simple terminal UI for git commands
brew "lazygit"
# Library that implements the rsync remote-delta algorithm
brew "librsync"
# YAML Parser
brew "libyaml"
# Powerful, lightweight programming language (v5.1.5)
brew "lua@5.1"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Control nvim processes using `nvr` command-line tool
brew "neovim-remote"
# Small build system for use with gyp or CMake
brew "ninja"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Swiss-army knife of markup format conversion
brew "pandoc"
# PostgreSQL syntax beautifier
brew "pgformatter"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# 📦🚀 Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@14"
# Python version management
brew "pyenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Generate type safe Go from SQL
brew "sqlc"
# CLI utility for manipulating SQLite databases
brew "sqlite-utils"
# Opinionated Lua code formatter
brew "stylua"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Tool to build, change, and version infrastructure
brew "terraform"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Additional completion definitions for zsh
brew "zsh-completions"
# A git command extension for switching git branches more efficiently.
brew "craciuncezar/tap/git-smart-checkout"
# Enable Windows-like alt-tab
cask "alt-tab"
# Open links in any browser
cask "choosy"
# API documentation browser and code snippet manager
cask "dash"
# App to build and share containerized applications and microservices
cask "docker"
# Tool to hide status bar icons
cask "dozer"
# Matrix collaboration client
cask "element"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Desktop automation application
cask "hammerspoon"
# Free and open-source media player
cask "iina"
# GPU-based terminal emulator
cask "kitty"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Collaboration platform for API development
cask "postman"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Multimedia player
cask "vlc"
# Torrent streaming application
cask "webtorrent"
# HTML to PDF renderer
cask "wkhtmltopdf"
mas "Amphetamine", id: 937984704
mas "Color Picker", id: 1545870783
mas "Dropover", id: 1355679052
mas "GIF Brewery 3", id: 1081413713
mas "Hand Mirror", id: 1502839586
mas "Microsoft Outlook", id: 985367838
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Prime Video", id: 545519333
mas "Shortery", id: 1594183810
mas "Xcode", id: 497799835
