tap "tomanthony/brews"
tap "buo/cask-upgrade"
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "caskroom/cask"
tap "beeftornado/rmtree"
tap "neovim/neovim"
cask "java"
brew "diff-so-fancy"
brew "editorconfig"
brew "git"
brew "go"
brew "gradle"
brew "node"
brew "hub"
brew "hyper"
brew "mas"
brew "mongodb", restart_service: true
brew "neovim"
brew "ripgrep"
brew "tig"
brew "tree"
brew "vim"
brew "watchman"
brew "wget"
brew "yarn"
brew "z"
brew "zsh"
cask "alfred"
cask "dash"
cask "firefox"
cask "franz"
cask "hyper"
cask "karabiner-elements"
cask "mongodb-compass"
cask "slack"
cask "spectacle"
cask "spotify"
cask "zeplin"
cask "caskroom/fonts/font-fira-code"
cask "caskroom/fonts/font-firacode-nerd-font"
