tap "tomanthony/brews"
tap "buo/cask-upgrade"
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/cask-fonts"
tap "caskroom/cask-versions"
tap "caskroom/cask-cask"
tap "neovim/neovim"
tap "jesseduffield/lazygit/lazygit"
brew "git"
brew "hub"
brew "kitty"
brew "alacritty"
brew "neovim"
brew "ripgrep"
brew "tree"
brew "wget"
brew "yarn"
brew "z"
brew "git-delta"
brew "lazygit"
cask "alfred"
cask "dash"
cask "firefox"
cask "franz"
cask "karabiner-elements"
cask "slack"
cask "google-chrome"
cask "spectacle"
cask "spotify"
cask "caskroom/cask-fonts/font-fira-code"
cask "caskroom/cask-fonts/font-firacode-nerd-font"
