tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'neovim/neovim'
tap 'tomanthony/brews'
brew 'autoconf'
brew 'automake'
brew 'cmake'
brew 'ctags'
brew 'pcre'
brew 'editorconfig'
brew 'gdbm'
brew 'gettext'
brew 'jemalloc'
brew 'openssl'
brew 'libevent'
brew 'libssh2'
brew 'libtermkey'
brew 'libtool'
brew 'libuv'
brew 'libvterm'
brew 'libyaml'
brew 'markdown'
brew 'mongodb'
brew 'msgpack'
brew 'node'
brew 'perl'
brew 'pkg-config'
brew 'readline'
brew 'sqlite'
brew 'python'
brew 'xz'
brew 'python3'
brew 'ruby-build'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'ruby'
brew 'rust'
brew 'tmux'
brew 'unibilium'
brew 'vim'
brew 'yarn'
brew 'z'
brew 'zsh'
brew 'neovim/neovim/neovim'
cask 'font-firacode-nerd-font-mono'
cask 'font-firamono-nerd-font'
cask 'font-hack-nerd-font'
cask 'font-inconsolata-nerd-font'
cask 'font-meslo-nerd-font'
cask 'iterm2'
cask 'mongodb-compass'
cask 'robomongo'
