tap "tomanthony/brews"
tap "thoughtbot/formulae"
tap "iveney/mocha"
tap "buo/cask-upgrade"
tap "homebrew/core"
tap "homebrew/versions"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "caskroom/cask"
tap "beeftornado/rmtree"
tap "neovim/neovim"
tap "universal-ctags/universal-ctags"
cask "java"
cask "xquartz"
brew "archey"
brew "autoconf"
brew "automake"
brew "bash"
brew "boot-clj"
brew "chromedriver", restart_service: true
brew "cmake"
brew "cowsay"
brew "ctags", link: false
brew "diff-so-fancy"
brew "editorconfig"
brew "elixir"
brew "emacs"
brew "emojify"
brew "exercism"
brew "extract_url"
brew "fasd"
brew "flow"
brew "libtool"
brew "fontforge"
brew "fortune"
brew "ghi"
brew "git"
brew "go"
brew "gradle"
brew "heroku"
brew "lua"
brew "highlight"
brew "htop"
brew "xz"
brew "httpie"
brew "hub"
brew "oniguruma"
brew "jq"
brew "lastpass-cli"
brew "leiningen"
brew "libssh2"
brew "lighttpd"
brew "lolcat"
brew "macvim"
brew "markdown"
brew "mas"
brew "mongodb", restart_service: true
brew "mutt"
brew "neovim"
brew "node@6"
brew "pandoc"
brew "peco"
brew "pgcli"
brew "phantomjs"
brew "postgresql", restart_service: true
brew "pyenv"
brew "pyenv-virtualenv", args: ["HEAD"]
brew "ranger"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "redis"
brew "ripgrep"
brew "shellcheck"
brew "svg2png"
brew "the_silver_searcher"
brew "thefuck"
brew "tidy-html5"
brew "tig"
brew "tmux"
brew "tree"
brew "unrar"
brew "urlview"
brew "vim", args: ["HEAD"]
brew "watchman"
brew "wget"
brew "yarn"
brew "z"
brew "zsh"
brew "iveney/mocha/realpath"
brew "thoughtbot/formulae/rcm"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "alfred"
cask "dash"
cask "devdocs"
cask "discord"
cask "fontforge"
cask "franz"
cask "graphiql"
cask "hyper"
cask "iterm2"
cask "karabiner-elements"
cask "keycastr"
cask "mongodb-compass"
cask "ngrok"
cask "oni"
cask "opera"
cask "postgres"
cask "postman"
cask "react-native-debugger"
cask "skype"
cask "spectacle"
cask "spotify"
cask "upterm"
cask "vimr"
cask "vlc"
cask "webtorrent"
cask "zeplin"
cask "caskroom/fonts/font-3270-nerd-font-mono"
cask "caskroom/fonts/font-anonymouspro-nerd-font"
cask "caskroom/fonts/font-anonymouspro-nerd-font-mono"
cask "caskroom/fonts/font-bitstreamverasansmono-nerd-font"
cask "caskroom/fonts/font-fira-code"
cask "caskroom/fonts/font-firacode-nerd-font"
cask "caskroom/fonts/font-firacode-nerd-font-mono"
cask "caskroom/fonts/font-firamono-nerd-font"
cask "caskroom/fonts/font-hack-nerd-font"
cask "caskroom/fonts/font-hasklig-nerd-font"
cask "caskroom/fonts/font-inconsolata-nerd-font"
cask "caskroom/fonts/font-input"
cask "caskroom/fonts/font-meslo-nerd-font"
cask "caskroom/fonts/font-monoid"
cask "caskroom/fonts/font-monoid-nerd-font"
mas "Evernote", id: 406056744
mas "GIPHY CAPTURE", id: 668208984
mas "iMovie", id: 408981434
mas "iPhoto", id: 408981381
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
