tap "beeftornado/rmtree"
tap "buo/cask-upgrade"
tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/versions"
tap "iveney/mocha"
tap "neovim/neovim"
tap "thoughtbot/formulae"
tap "tomanthony/brews"
tap "universal-ctags/universal-ctags"
cask "java"
cask "xquartz"
brew "autoconf"
brew "automake"
brew "readline"
brew "bash"
brew "boot-clj"
brew "gettext"
brew "cmake"
brew "ctags"
brew "diff-so-fancy"
brew "editorconfig"
brew "emojify"
brew "exercism"
brew "extract_url"
brew "fasd"
brew "flow"
brew "libtool"
brew "fontforge"
brew "go"
brew "heroku"
brew "htop"
brew "xz"
brew "httpie"
brew "hub"
brew "oniguruma"
brew "jq"
brew "leiningen"
brew "libssh2"
brew "libvterm"
brew "libyaml"
brew "mackup"
brew "macvim"
brew "markdown"
brew "mas"
brew "mobile-shell"
brew "mongodb"
brew "unibilium"
brew "neovim"
brew "node@6"
brew "pandoc"
brew "peco"
brew "perl"
brew "pgcli"
brew "phantomjs"
brew "postgresql", restart_service: true
brew "pyenv"
brew "pyenv-virtualenv", args: ["HEAD"]
brew "ranger"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "svg2png"
brew "the_silver_searcher"
brew "thefuck"
brew "tidy-html5"
brew "tig"
brew "tmux"
brew "tree"
brew "urlview"
brew "vim", args: ["with-lua"]
brew "watchman"
brew "wget"
brew "yarn"
brew "z"
brew "zsh"
brew "iveney/mocha/realpath"
brew "thoughtbot/formulae/rcm"
cask "alfred"
cask "dash"
cask "flux"
cask "font-3270-nerd-font-mono"
cask "font-anonymouspro-nerd-font"
cask "font-anonymouspro-nerd-font-mono"
cask "font-bitstreamverasansmono-nerd-font"
cask "font-fira-code"
cask "font-firacode-nerd-font-mono"
cask "font-firamono-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-input"
cask "font-meslo-nerd-font"
cask "fontforge"
cask "iterm2-nightly"
cask "mongodb-compass"
cask "ngrok"
cask "opera"
cask "postgres"
cask "robomongo"
cask "sdformatter"
cask "shiba"
cask "skype"
cask "spectacle"
cask "upterm"
cask "webtorrent"
mas "Caffeine", id: 411246225
mas "Evernote", id: 406056744
mas "GIPHY CAPTURE", id: 668208984
mas "iMovie", id: 408981434
mas "iPhoto", id: 408981381
mas "Keynote", id: 409183694
mas "MemoryBooster", id: 592647907
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Pocket", id: 568494494
mas "Shazam", id: 897118787
mas "Spark", id: 1176895641
mas "The Unarchiver", id: 425424353
mas "Wunderlist", id: 410628904
mas "Xcode", id: 497799835
