tap "tomanthony/brews"
tap "thoughtbot/formulae"
tap "buo/cask-upgrade"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "beeftornado/rmtree"
tap "neovim/neovim"
tap "universal-ctags/universal-ctags"
cask "java"
brew "archey"
brew "bash"
brew "bat"
brew "cmake"
brew "ctags", link: false
brew "diff-so-fancy"
brew "editorconfig"
brew "elixir"
brew "emojify"
brew "exercism"
brew "extract_url"
brew "flow"
brew "libtool"
brew "fontforge"
brew "fzf"
brew "ghi"
brew "git"
brew "go"
brew "gradle"
brew "lua"
brew "highlight"
brew "htop"
brew "python"
brew "httpie"
brew "hub"
brew "hyper"
brew "oniguruma"
brew "jq"
brew "lastpass-cli"
brew "libssh2"
brew "lolcat"
brew "macvim"
brew "markdown"
brew "mas"
brew "mongodb", restart_service: true
brew "neovim"
brew "pandoc"
brew "peco"
brew "pgcli"
brew "postgresql", restart_service: true
brew "pyenv"
brew "pyenv-virtualenv", args: ["HEAD"]
brew "ranger"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "redis"
brew "ripgrep"
brew "shellcheck"
brew "svg2png"
brew "the_silver_searcher"
brew "thefuck"
brew "tig"
brew "tmux"
brew "tree"
brew "unrar"
brew "urlview"
brew "vim"
brew "watchman"
brew "wget"
brew "yarn"
brew "z"
brew "zsh"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "alfred"
cask "android-platform-tools"
cask "android-studio"
cask "dash"
cask "discord"
cask "dropbox"
cask "firefox"
cask "fontforge"
cask "franz"
cask "hyper"
cask "iterm2"
cask "karabiner-elements"
cask "keycastr"
cask "kitty"
cask "mongodb-compass"
cask "ngrok"
cask "opera"
cask "postgres"
cask "postman"
cask "react-native-debugger"
cask "sketch"
cask "slack"
cask "spectacle"
cask "spotify"
cask "vlc"
cask "webtorrent"
cask "xquartz"
cask "zeplin"
cask "homebrew/cask-fonts/font-cousine-nerd-font-mono"
cask "homebrew/cask-fonts/font-fira-code"
cask "homebrew/cask-fonts/font-firacode-nerd-font"
cask "homebrew/cask-fonts/font-go-mono-nerd-font"
cask "homebrew/cask-fonts/font-hasklig-nerd-font"
cask "homebrew/cask-fonts/font-mononoki-nerd-font"
cask "homebrew/cask-fonts/font-source-code-pro"
cask "homebrew/cask-versions/java8"
mas "GIPHY CAPTURE", id: 668208984
mas "iMovie", id: 408981434
mas "NordVPN IKE", id: 1116599239
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
