{
  "LuaSnip": { "branch": "master" },
  "avante.nvim": { "branch": "main" },
  "beacon.nvim": { "branch": "main" },
  "bufdelete.nvim": { "branch": "master" },
  "ccc.nvim": { "branch": "main" },
  "cmp-buffer": { "branch": "main" },
  "cmp-dap": { "branch": "master" },
  "cmp-emoji": { "branch": "main" },
  "cmp-git": { "branch": "main" },
  "cmp-nvim-lsp": { "branch": "main" },
  "cmp-path": { "branch": "main" },
  "cmp-rg": { "branch": "master" },
  "cmp-spell": { "branch": "master" },
  "cmp_luasnip": { "branch": "master" },
  "conform.nvim": { "branch": "master" },
  "copilot.vim": { "branch": "release" },
  "crates.nvim": { "branch": "main" },
  "danger": { "branch": "main" },
  "debugprint.nvim": { "branch": "main" },
  "dial.nvim": { "branch": "master" },
  "diffview.nvim": { "branch": "main" },
  "dressing.nvim": { "branch": "master" },
  "dropbar.nvim": { "branch": "master" },
  "flash.nvim": { "branch": "main" },
  "flatten.nvim": { "branch": "main" },
  "flutter-riverpod-snippets": { "branch": "master" },
  "fold-cycle.nvim": { "branch": "main" },
  "friendly-snippets": { "branch": "main" },
  "fzf-lua": { "branch": "main" },
  "github-nvim-theme": { "branch": "main" },
  "gitlinker.nvim": { "branch": "master" },
  "gitsigns.nvim": { "branch": "main" },
  "glance.nvim": { "branch": "master" },
  "gopher.nvim": { "branch": "main" },
  "hererocks": { "branch": "master" },
  "hydra.nvim": { "branch": "master" },
  "image.nvim": { "branch": "master" },
  "img-clip.nvim": { "branch": "main" },
  "inc-rename.nvim": { "branch": "main" },
  "indent-blankline.nvim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lazydev.nvim": { "branch": "main" },
  "lspkind.nvim": { "branch": "master" },
  "luvit-meta": { "branch": "main" },
  "markdown-preview.nvim": { "branch": "master" },
  "marks.nvim": { "branch": "master" },
  "mason-lspconfig.nvim": { "branch": "main" },
  "mason.nvim": { "branch": "main" },
  "mini.ai": { "branch": "main" },
  "multicursors.nvim": { "branch": "main" },
  "neo-tree.nvim": { "branch": "v3.x" },
  "neoconf.nvim": { "branch": "main" },
  "neoscroll.nvim": { "branch": "master" },
  "neotest": { "branch": "master" },
  "neotest-dart": { "branch": "main" },
  "neotest-jest": { "branch": "main" },
  "neotest-plenary": { "branch": "master" },
  "neotest-rust": { "branch": "main" },
  "night-owl.nvim": { "branch": "main" },
  "noice.nvim": { "branch": "main" },
  "nui.nvim": { "branch": "main" },
  "numb.nvim": { "branch": "master" },
  "nvim-autopairs": { "branch": "master" },
  "nvim-bqf": { "branch": "main" },
  "nvim-cmp": { "branch": "main" },
  "nvim-dap": { "branch": "master" },
  "nvim-dap-ui": { "branch": "master" },
  "nvim-dap-virtual-text": { "branch": "master" },
  "nvim-dap-vscode-js": { "branch": "main" },
  "nvim-fundo": { "branch": "main" },
  "nvim-lightbulb": { "branch": "master" },
  "nvim-lint": { "branch": "master" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-luapad": { "branch": "master" },
  "nvim-nio": { "branch": "master" },
  "nvim-notify": { "branch": "master" },
  "nvim-pqf": { "branch": "main" },
  "nvim-surround": { "branch": "main" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-treesitter-context": { "branch": "master" },
  "nvim-treesitter-textobjects": { "branch": "master" },
  "nvim-ts-autotag": { "branch": "main" },
  "nvim-web-devicons": { "branch": "master" },
  "package-info.nvim": { "branch": "master" },
  "persisted.nvim": { "branch": "main" },
  "pgsql.vim": { "branch": "master" },
  "plenary.nvim": { "branch": "master" },
  "rainbow-delimiters.nvim": { "branch": "master" },
  "render-markdown.nvim": { "branch": "main" },
  "rust-tools.nvim": { "branch": "master" },
  "schemastore.nvim": { "branch": "main" },
  "sibling-swap.nvim": { "branch": "main" },
  "smart-splits.nvim": { "branch": "master" },
  "substitute.nvim": { "branch": "main" },
  "symbol-usage.nvim": { "branch": "main" },
  "tabout.nvim": { "branch": "master" },
  "todo-comments.nvim": { "branch": "main" },
  "treesj": { "branch": "main" },
  "tsc.nvim": { "branch": "main" },
  "typescript-tools.nvim": { "branch": "master" },
  "undotree": { "branch": "master" },
  "vim-abolish": { "branch": "master" },
  "vim-dadbod": { "branch": "master" },
  "vim-dadbod-ui": { "branch": "master" },
  "vim-dirtytalk": { "branch": "master" },
  "vim-eunuch": { "branch": "master" },
  "vim-highlighturl": { "branch": "master" },
  "vim-kitty": { "branch": "main" },
  "vim-log-highlighting": { "branch": "master" },
  "vim-operator-user": { "branch": "master" },
  "vim-projectionist": { "branch": "master" },
  "vim-repeat": { "branch": "master" },
  "vim-sleuth": { "branch": "master" },
  "vim-startuptime": { "branch": "master" },
  "vim-textobj-comment": { "branch": "master" },
  "vim-textobj-user": { "branch": "master" },
  "vim-wordmotion": { "branch": "master" },
  "virt-column.nvim": { "branch": "master" },
  "which-key.nvim": { "branch": "main" },
  "window-picker": { "branch": "main" }
}
